### Pandas の groupby の使い方
#### https://qiita.com/propella/items/a9a32b878c77222630ae

In [16]:
import pandas as pd
import numpy as np

In [17]:
df = pd.DataFrame({
    'city': ['osaka', 'osaka', 'osaka', 'osaka', 'tokyo', 'tokyo', 'tokyo'],
    'food': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
})
display(df)

    city    food  price  quantity
0  osaka   apple    100         1
1  osaka  orange    200         2
2  osaka  banana    250         3
3  osaka  banana    300         4
4  tokyo   apple    150         5
5  tokyo   apple    200         6
6  tokyo  banana    400         7

In [18]:
df.columns # 列 label の取得

Index(['city', 'food', 'price', 'quantity'], dtype='object')

In [19]:
df.index # 行 label の取得

RangeIndex(start=0, stop=7, step=1)

In [25]:
display(df.groupby('city').head(2))
#上記のようにグループバイにheadをつけると、各グループ内で上位の２個が出てくる

print('---------------------------------------------------------')
display(df.groupby('city').mean())

    city    food  price  quantity
0  osaka   apple    100         1
1  osaka  orange    200         2
4  tokyo   apple    150         5
5  tokyo   apple    200         6

---------------------------------------------------------

/tmp/ipykernel_3564/4104971175.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  display(df.groupby('city').mean())

       price  quantity
city
osaka  212.5       2.5
tokyo  250.0       6.0

In [24]:
df.groupby(['city', 'food']).mean()

              price  quantity
city  food
osaka apple   100.0       1.0
      banana  275.0       3.5
      orange  200.0       2.0
tokyo apple   175.0       5.5
      banana  400.0       7.0

In [25]:
df.groupby(['city', 'food'], as_index=False).mean()

    city    food  price  quantity
0  osaka   apple  100.0       1.0
1  osaka  banana  275.0       3.5
2  osaka  orange  200.0       2.0
3  tokyo   apple  175.0       5.5
4  tokyo  banana  400.0       7.0

# さまざまな Aggregation

In [26]:
df.groupby('city').agg(np.mean)

       price  quantity
city
osaka  212.5       2.5
tokyo  250.0       6.0

In [28]:
def my_mean(s):
    """わざとらしいサンプル"""
    return np.mean(s)

df.groupby('city').agg({'price': np.mean, 'quantity': np.sum})
# df.groupby('city').agg({'price': my_mean, 'quantity': np.sum})

       price  quantity
city
osaka  212.5        10
tokyo  250.0        18

# Group ごとに複数行を返す

In [30]:
display(df.groupby(['city', 'food'], as_index=False))
print('---------------------------------------------------------')
display(df.groupby(['city', 'food'], as_index=False).apply(lambda d: (d.price * d.quantity).sum()))

---------------------------------------------------------

               city    food   NaN
city  food
osaka apple   osaka   apple   100
      banana  osaka  banana  1950
      orange  osaka  orange   400
tokyo apple   tokyo   apple  1950
      banana  tokyo  banana  2800